import React from 'react'

function ChargeCrypto() {
    return (
        <section className='mt-15 mb-80 font-lahze'>
            <div className="container">
                <h2 className='mb-6 text-lg md:text-xl lg:text-3xl font-extrabold text-slate-700'>شارژ و نقد حساب های ارزی</h2>
                <p>شارژ و نقد حساب شما با نرخ رقابتی؛ کمتر از ۲ ساعت</p>

                <div>
                    {/* هاله نور پشت سکشن */}
                    <div></div>
                    {/* یاکس سمت راست */}
                    <div>
                        <div>
                            <div>
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M7.078 20.25H10.155L11.531 11.517H15.011C18.423 11.517 20.301 9.839 20.655 6.444C20.817 4.887 20.407 3.593 19.467 2.651C18.665 1.849 17.303 1.5 15.465 1.5H8.761C8.243 1.5 7.795 1.868 7.708 2.378L5.275 17.842C5.176 18.472 5.662 19.043 6.3 19.043H7.406L7.078 20.25Z" fill="white"></path>
                                    <path d="M10.155 20.25H7.078L6.724 22.493C6.634 23.064 7.086 23.585 7.665 23.585H10.518C10.957 23.585 11.336 23.272 11.411 22.842L11.666 21.229L11.838 20.25H10.155Z" fill="#003087"></path>
                                </svg>
                            </div>
                            <div>
                                <h3>شارژ و نقد حساب پی پال</h3>
                                <p>پی‌پال خود را سریع و بدون محدودیت شارژ و نقد کنید!</p>
                            </div>
                        </div>
                    </div>
                    {/* گوشی موبایل */}
                    <div>
                        <div>
                            {/* رنگ موج درا پشت گوشی */}
                            <div></div>
                            {/* گوشی موبایل */}
                            <div>
                                <span>12:00</span>
                                <div className="flex gap-1.5 items-center">
                                    <svg width="12" height="12" viewBox="0 0 24 24" fill="#34405a">
                                        <path d="M12.01 21.49L23.64 7c-.45-.34-4.93-4-11.64-4C5.28 3 .81 6.66.36 7l11.63 14.49.01.01.01-.01z"></path>
                                    </svg>
                                    <svg width="14" height="14" viewBox="0 0 24 24" fill="#34405a">
                                        <path d="M15.67 4H14V2h-4v2H8.33C7.6 4 7 4.6 7 5.33v15.33C7 21.4 7.6 22 8.33 22h7.33c.74 0 1.34-.6 1.34-1.33V5.33C17 4.6 16.4 4 15.67 4z"></path>
                                    </svg>
                                </div>
                            </div>
                            <div>
                                <div>
                                    <svg width="28" height="28" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M7.078 20.25H10.155L11.531 11.517H15.011C18.423 11.517 20.301 9.839 20.655 6.444C20.817 4.887 20.407 3.593 19.467 2.651C18.665 1.849 17.303 1.5 15.465 1.5H8.761C8.243 1.5 7.795 1.868 7.708 2.378L5.275 17.842C5.176 18.472 5.662 19.043 6.3 19.043H7.406L7.078 20.25Z" fill="currentColor"></path>
                                    </svg>
                                </div>
                                <p>موجودی حساب پی پال شما</p>
                                <h4>$210</h4>
                            </div>
                        </div>
                    </div>
                    {/* یاکس سمت راست */}

                    <div>
                        <div>
                            <div>
                                <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M7.078 20.25H10.155L11.531 11.517H15.011C18.423 11.517 20.301 9.839 20.655 6.444C20.817 4.887 20.407 3.593 19.467 2.651C18.665 1.849 17.303 1.5 15.465 1.5H8.761C8.243 1.5 7.795 1.868 7.708 2.378L5.275 17.842C5.176 18.472 5.662 19.043 6.3 19.043H7.406L7.078 20.25Z" fill="white"></path>
                                    <path d="M10.155 20.25H7.078L6.724 22.493C6.634 23.064 7.086 23.585 7.665 23.585H10.518C10.957 23.585 11.336 23.272 11.411 22.842L11.666 21.229L11.838 20.25H10.155Z" fill="#003087"></path>
                                </svg>
                            </div>
                            <div>
                                <h3>شارژ و نقد حساب پی پال</h3>
                                <p>پی‌پال خود را سریع و بدون محدودیت شارژ و نقد کنید!</p>
                            </div>
                        </div>
                    </div>

                </div>

            </div>
        </section>
    )
}

export default ChargeCrypto